app/controllers/trees_controller.rb

  def index
      @trees = Tree.all
---
SELECT "trees".* FROM "trees"

  def show
    @tree = Tree.find(params[:id])
---
SELECT "trees".* FROM "trees" WHERE "trees"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @tree = Tree.new(tree_params)
    @tree.user = current_user

    respond_to do |format|
      if @tree.save
---
INSERT INTO "trees" ("circum", "created_at", "date", "direction", "droad", "dwater", "lat", "light", "long", "notes", "parea_content_type", "parea_file_name", "parea_file_size", "parea_updated_at", "pleaf_content_type", "pleaf_file_name", "pleaf_file_size", "pleaf_updated_at", "ptree_content_type", "ptree_file_name", "ptree_file_size", "ptree_updated_at", "species", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)