app/controllers/welcome_controller.rb

  def index
    @trees = Tree.all
---
SELECT "trees".* FROM "trees"